In [1]:
"""
AUTHOR:KRISTAL SHRESTHA
DATE:6/19/2024
PURPOSE:BEGINNING PANDAS
"""

'\nAUTHOR:KRISTAL SHRESTHA\nDATE:6/19/2024\nPURPOSE:BEGINNING PANDAS\n'

In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame()

In [4]:
df

Empty DataFrame
Columns: []
Index: []

In [5]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[23,29,12,13],[44,98,110,22]])

In [7]:
df1

    0   1    2   3
0   1   2    3   4
1   5   6    7   8
2  23  29   12  13
3  44  98  110  22

In [11]:
df1.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [10]:
df1.tail(2)

    0   1    2   3
2  23  29   12  13
3  44  98  110  22